; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v13)
             (pred_6 ?v8 ?v10)
             (pred_7 ?v3 ?v10)
             (pred_9 ?v4 ?v3 )
	     (pred_3 ?v3)
             (pred_8 ?v9)
             (pred_2 ?v8)
             (pred_10 ?v10)
             (pred_12 ?v3)
             (pred_11 ?v8)
             (pred_4 ?v3)
             (pred_1 ))



(:action op_5
:parameters (?v2 ?v11 ?v5 ?v7)
:precondition (and (pred_8 ?v2) (pred_8 ?v11) (pred_2 ?v5) (pred_10 ?v7)
          (pred_5 ?v2 ?v11) (pred_6 ?v5 ?v7)
                   (pred_7 ?v11 ?v7) (pred_3 ?v2) 
                   (pred_12 ?v11) (pred_11 ?v5))
:effect (and  (pred_4 ?v11) (not (pred_12 ?v11))))


(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_8 ?v2) (pred_8 ?v1)
               (pred_3 ?v2) (pred_5 ?v2 ?v1) (pred_4 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v2))))

(:action op_4
:parameters (?v2 ?v5)
:precondition (and (pred_8 ?v2) (pred_2 ?v5) 
                  (pred_3 ?v2) (pred_9 ?v5 ?v2) (pred_1 ))
:effect (and (pred_11 ?v5)
   (not (pred_9 ?v5 ?v2)) (not (pred_1 ))))


(:action op_3
:parameters (?v2 ?v6 ?v12)
:precondition (and (pred_8 ?v2) (pred_2 ?v6) (pred_2 ?v12)
                  (pred_3 ?v2) (pred_11 ?v12) (pred_9 ?v6 ?v2))
:effect (and (pred_11 ?v6) (pred_9 ?v12 ?v2)
        (not (pred_11 ?v12)) (not (pred_9 ?v6 ?v2))))

(:action op_2
:parameters (?v2 ?v5)
:precondition (and (pred_8 ?v2) (pred_2 ?v5) 
                  (pred_3 ?v2) (pred_11 ?v5))
:effect (and (pred_1 ) (pred_9 ?v5 ?v2) (not (pred_11 ?v5)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_12 obj_27 obj_29 obj_30 obj_19 obj_06 obj_09 obj_31 obj_14 obj_32 obj_15 obj_21 obj_04 obj_24 obj_23 obj_08 obj_25 obj_05 obj_28 obj_07 obj_20 obj_16 obj_11 obj_13 obj_03
    obj_10 obj_17 obj_26
    obj_18 obj_02 obj_22 obj_01
    )

    (:init
       (pred_1)

       (pred_8 obj_12)
       (pred_8 obj_27)
       (pred_8 obj_29)
       (pred_8 obj_30)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_09)
       (pred_8 obj_31)
       (pred_8 obj_14)
       (pred_8 obj_32)
       (pred_8 obj_15)
       (pred_8 obj_21)
       (pred_8 obj_04)
       (pred_8 obj_24)
       (pred_8 obj_23)
       (pred_8 obj_08)
       (pred_8 obj_25)
       (pred_8 obj_05)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_26)
       (pred_2 obj_18)
       (pred_2 obj_02)
       (pred_2 obj_22)
       (pred_2 obj_01)

       (pred_5 obj_12 obj_06)
       (pred_5 obj_12 obj_27)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_27 obj_29)
       (pred_5 obj_27 obj_12)
       (pred_5 obj_29 obj_31)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_29 obj_27)
       (pred_5 obj_30 obj_14)
       (pred_5 obj_30 obj_19)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_19 obj_32)
       (pred_5 obj_19 obj_30)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_09 obj_21)
       (pred_5 obj_09 obj_31)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_31 obj_04)
       (pred_5 obj_31 obj_14)
       (pred_5 obj_31 obj_29)
       (pred_5 obj_31 obj_09)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_14 obj_32)
       (pred_5 obj_14 obj_30)
       (pred_5 obj_14 obj_31)
       (pred_5 obj_32 obj_23)
       (pred_5 obj_32 obj_19)
       (pred_5 obj_32 obj_14)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_06)
       (pred_5 obj_21 obj_25)
       (pred_5 obj_21 obj_04)
       (pred_5 obj_21 obj_09)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_24)
       (pred_5 obj_04 obj_31)
       (pred_5 obj_04 obj_21)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_24 obj_23)
       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_04)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_32)
       (pred_5 obj_23 obj_24)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_08 obj_25)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_25 obj_16)
       (pred_5 obj_25 obj_05)
       (pred_5 obj_25 obj_21)
       (pred_5 obj_25 obj_08)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_28)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_25)
       (pred_5 obj_28 obj_13)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_28 obj_05)
       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_23)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_25)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_13 obj_28)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_03 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_21)
       (pred_12 obj_28)
       (pred_12 obj_03)
       (pred_7  obj_12 obj_10)
       (pred_7  obj_21 obj_17)
       (pred_7  obj_28 obj_26)
       (pred_7  obj_03 obj_10)
       (pred_4 obj_27)
       (pred_4 obj_29)
       (pred_4 obj_30)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_09)
       (pred_4 obj_31)
       (pred_4 obj_14)
       (pred_4 obj_32)
       (pred_4 obj_15)
       (pred_4 obj_04)
       (pred_4 obj_24)
       (pred_4 obj_23)
       (pred_4 obj_08)
       (pred_4 obj_25)
       (pred_4 obj_05)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_11)
       (pred_4 obj_13)

       (pred_6  obj_18 obj_10)
       (pred_6  obj_02 obj_17)
       (pred_6  obj_22 obj_26)
       (pred_6  obj_01 obj_26)
       (pred_9 obj_18 obj_31)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_01 obj_06)
       (pred_3 obj_23)
    )

    (:goal (and
       (pred_9 obj_18 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_04)))
)
)

; plan
1. (op_1 obj_23 obj_32)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_32)
   goals met: 0 of 1
2. (op_1 obj_32 obj_14)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_14)
   goals met: 0 of 1
3. (op_1 obj_14 obj_31)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_31)
   goals met: 0 of 1
4. (op_4 obj_31 obj_18)
   deleted: (pred_9 obj_18 obj_31) (pred_1)
   added: (pred_11 obj_18)
   goals met: 0 of 1
5. (op_1 obj_31 obj_14)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_14)
   goals met: 0 of 1
6. (op_1 obj_14 obj_24)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_24)
   goals met: 0 of 1
7. (op_1 obj_24 obj_23)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_23)
   goals met: 0 of 1
8. (op_1 obj_23 obj_07)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_07)
   goals met: 0 of 1
9. (op_5 obj_07 obj_03 obj_18 obj_10)
   deleted: (pred_12 obj_03)
   added: (pred_4 obj_03)
   goals met: 0 of 1
10. (op_1 obj_07 obj_03)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_03)
   goals met: 0 of 1
11. (op_1 obj_03 obj_13)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_13)
   goals met: 0 of 1
12. (op_1 obj_13 obj_11)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_11)
   goals met: 0 of 1
13. (op_3 obj_11 obj_02 obj_18)
   deleted: (pred_11 obj_18) (pred_9 obj_02 obj_11)
   added: (pred_11 obj_02) (pred_9 obj_18 obj_11)
   goals met: 1 of 1
